Tekla.Structures.Internal.dotGetAdvancedOption_t.#ctor(System.String,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
OptionName:
OptionType:
ValueStringIteration:

Tekla.Structures.Internal.dotGetAdvancedOption_t.Type
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueBool
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueInt
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotGetAdvancedOption_t.aValueString
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueDouble
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.dotGetAdvancedOption_t.ValueStringIteration
From API to core tells chunk to receive, from core to API tells if there are more chunks to be fetched.